[
    {
        "title": "GTA V",
        "category": ["popular"],
        "price": "$20.00",
        "imageName": "gtav",
        "pageImage": "gtav_page",
        "basketImage": "gtav_basket",
        "about": "Welcome to Los Santos. When a young street hustler, a retired bank robber, and a terrifying psychopath find themselves entangled with the most dangerous elements of the underworld, they must pull off a series of dangerous heists to survive in a ruthless city. Explore a massive open world filled with life, drive cars, planes, and motorcycles, and switch between three unique protagonists to experience the story from multiple perspectives.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "CS:GO",
        "category": ["popular", "free"],
        "price": "$0.00",
        "imageName": "csgo",
        "pageImage": "csgo_page",
        "basketImage": "csgo_basket",
        "about": "Counter-Strike: Global Offensive is a competitive team-based shooter where players take on the role of terrorists and counter-terrorists. Win rounds by planting or defusing bombs, rescuing hostages, and outsmarting opponents. Its precise gunplay and ranked matchmaking make it a global esports phenomenon.",
        "platforms": ["pc"]
    },
    {
        "title": "Hollow Knight",
        "category": ["popular", "indie"],
        "price": "$10.00",
        "imageName": "hollowknight",
        "pageImage": "hollowknight_page",
        "basketImage": "hollowknight_basket",
        "about": "Venture into the ancient, ruined kingdom of Hallownest in this action-adventure metroidvania. Explore massive, interconnected caverns, battle deadly creatures, and uncover hidden secrets. The haunting music and detailed hand-drawn art create an unforgettable experience.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "Elden Ring",
        "category": ["trending"],
        "price": "$59.99",
        "imageName": "eldenring",
        "pageImage": "eldenring_page",
        "basketImage": "eldenring_basket",
        "about": "Explore the vast open world of the Lands Between, created by Hidetaka Miyazaki and George R. R. Martin. Fight terrifying bosses, uncover secrets, and forge your path as you seek to become the Elden Lord. Its seamless world design and freedom of choice make every playthrough unique.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "Valorant",
        "category": ["trending", "free"],
        "price": "$0.00",
        "imageName": "valorant",
        "pageImage": "valorant_page",
        "basketImage": "valorant_basket",
        "about": "Valorant is a tactical 5v5 shooter where precise aim meets strategic ability usage. Play as unique agents with powerful skills, coordinate with your team, and dominate opponents in competitive matches. The game is updated frequently with new agents, maps, and balance changes.",
        "platforms": ["pc"]
    },
    {
        "title": "Stardew Valley",
        "category": ["indie"],
        "price": "$14.99",
        "imageName": "stardewvalley",
        "pageImage": "stardewvalley_page",
        "basketImage": "stardewvalley_basket",
        "about": "Take over your grandfather's farm and turn it into a thriving homestead. Plant crops, raise animals, fish, mine, and build relationships with the townsfolk. With seasonal events, marriage, and tons of customization, Stardew Valley is a relaxing yet addictive farming simulator.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "Minecraft",
        "category": ["popular"],
        "price": "$26.95",
        "imageName": "minecraft",
        "pageImage": "minecraft_page",
        "basketImage": "minecraft_basket",
        "about": "Build, explore, and survive in a blocky, infinite world. Gather resources, craft tools, and construct anything you can imagine while fending off hostile mobs. Play in creative mode for unlimited resources or survival mode for a true challenge.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "Forza Horizon 5",
        "category": ["newLaunch"],
        "price": "$49.99",
        "imageName": "forzahorizon5",
        "pageImage": "forzahorizon5_page",
        "basketImage": "forzahorizon5_basket",
        "about": "Experience the ultimate open-world racing adventure set in vibrant Mexico. Collect and customize hundreds of cars, compete in a variety of events, and explore ever-changing seasons and weather conditions. Forza Horizon 5 delivers a beautiful, dynamic driving experience.",
        "platforms": ["pc", "xbox"]
    },
    {
        "title": "Dead Cells",
        "category": ["indie"],
        "price": "$12.00",
        "imageName": "deadcells",
        "pageImage": "deadcells_page",
        "basketImage": "deadcells_basket",
        "about": "Dead Cells combines roguelike and metroidvania elements in a challenging action platformer. Battle through ever-changing levels, find powerful weapons, and improve your character with each run. Its tight controls and fast-paced combat keep players coming back.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "Cyberpunk 2077",
        "category": ["popular"],
        "price": "$29.99",
        "imageName": "cyberpunk2077",
        "pageImage": "cyberpunk2077_page",
        "basketImage": "cyberpunk2077_basket",
        "about": "Step into the neon streets of Night City as V, a cyber-enhanced mercenary chasing a one-of-a-kind implant. Shape your character’s story through choices, customize your weapons and cyberware, and engage in explosive combat. Cyberpunk 2077 offers a massive open world full of life and danger.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "Overwatch 2",
        "category": ["newLaunch", "free"],
        "price": "$0.00",
        "imageName": "overwatch2",
        "pageImage": "overwatch2_page",
        "basketImage": "overwatch2_basket",
        "about": "Overwatch 2 is a free-to-play team-based shooter with a constantly expanding roster of heroes. Play competitive, arcade, or story missions and work with your team to capture objectives. Frequent seasonal updates keep the game fresh with new content and balance patches.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "Rocket League",
        "category": ["free"],
        "price": "$0.00",
        "imageName": "rocketleague",
        "pageImage": "rocketleague_page",
        "basketImage": "rocketleague_basket",
        "about": "Rocket League is soccer with rocket-powered cars. Boost, flip, and fly through the air to score goals and pull off spectacular saves. With fast-paced matches and cross-platform play, Rocket League is endlessly competitive and fun.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "Red Dead Redemption 2",
        "category": ["popular"],
        "price": "$39.99",
        "imageName": "rdr2",
        "pageImage": "rdr2_page",
        "basketImage": "rdr2_basket",
        "about": "Step into the shoes of Arthur Morgan, an outlaw in the dying days of the Wild West. Ride across stunning landscapes, engage in shootouts, hunt animals, and make choices that shape your story. Red Dead Redemption 2 is one of the most immersive and detailed open worlds ever made.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "The Witcher 3: Wild Hunt",
        "category": ["popular"],
        "price": "$24.99",
        "imageName": "witcher3",
        "pageImage": "witcher3_page",
        "basketImage": "witcher3_basket",
        "about": "Play as Geralt of Rivia, a legendary monster hunter searching for his adopted daughter. Hunt dangerous beasts, navigate political intrigue, and explore a massive open world. The Witcher 3 delivers hundreds of hours of deep storytelling and branching choices.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "Sekiro: Shadows Die Twice",
        "category": ["trending"],
        "price": "$39.99",
        "imageName": "sekiro",
        "pageImage": "sekiro_page",
        "basketImage": "sekiro_basket",
        "about": "Play as a shinobi known as the One-Armed Wolf in this action-adventure masterpiece. Master precise swordplay, stealth mechanics, and grappling hook traversal to defeat deadly enemies and bosses. Sekiro rewards skill and perseverance with exhilarating combat.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "League of Legends",
        "category": ["popular", "free"],
        "price": "$0.00",
        "imageName": "lol",
        "pageImage": "lol_page",
        "basketImage": "lol_basket",
        "about": "League of Legends is a 5v5 competitive MOBA where players choose champions with unique abilities and battle on Summoner's Rift. Work with your team to destroy the enemy Nexus while defending your own. With hundreds of champions and constant updates, LoL is one of the most played games worldwide.",
        "platforms": ["pc"]
    },
    {
        "title": "Assassin's Creed Valhalla",
        "category": ["popular"],
        "price": "$49.99",
        "imageName": "acvalhalla",
        "pageImage": "acvalhalla_page",
        "basketImage": "acvalhalla_basket",
        "about": "Lead Eivor, a Viking raider, in a quest to build a new settlement in England. Raid enemy fortresses, grow your clan, and shape the future of your people through alliances and decisions. AC Valhalla combines brutal combat with deep exploration of a vast open world.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "DOOM Eternal",
        "category": ["trending"],
        "price": "$39.99",
        "imageName": "doom",
        "pageImage": "doometernal_page",
        "basketImage": "doometernal_basket",
        "about": "Rip and tear through hordes of demons in fast, fluid combat. Use a variety of weapons, glory kills, and movement abilities to annihilate your enemies. DOOM Eternal is the ultimate power fantasy for shooter fans.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "Hades",
        "category": ["indie"],
        "price": "$24.99",
        "imageName": "hades",
        "pageImage": "hades_page",
        "basketImage": "hades_basket",
        "about": "Play as Zagreus, son of Hades, as you attempt to escape the Underworld. Wield powerful weapons, gain boons from Olympian gods, and experience a story that grows with each run. Hades blends rogue-like gameplay with rich storytelling and fast action.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "Call of Duty: Modern Warfare II",
        "category": ["trending"],
        "price": "$69.99",
        "imageName": "mw2",
        "pageImage": "mw2_page",
        "basketImage": "mw2_basket",
        "about": "Join Task Force 141 in a globe-trotting campaign full of cinematic missions and intense firefights. Experience refined gunplay, new multiplayer modes, and the cooperative Spec Ops experience. Modern Warfare II delivers the most advanced Call of Duty yet.",
        "platforms": ["pc", "xbox", "playstation"]
    },
    {
        "title": "Uncharted 4: A Thief's End",
        "category": ["popular"],
        "price": "$29.99",
        "imageName": "uncharted4",
        "pageImage": "uncharted4_page",
        "basketImage": "uncharted4_basket",
        "about": "Join Nathan Drake on his final adventure as he is pulled out of retirement by his long-lost brother, Sam. Travel across the globe to uncover a historical conspiracy, solve ancient puzzles, and engage in cinematic gunfights. Uncharted 4 delivers a breathtaking mix of action, exploration, and storytelling, with some of the best visuals and set pieces in gaming.",
        "platforms": ["playstation", "pc"]
    }

]
